\#+INCLUDE: "~/org/header/header.org"

* Аппроксимация
** Литература
[[\\solver\dfni$\%D0%93%D1%80%D0%B0%D1%84%D0%B8%D0%BA%D0%B0\Gnuplot\Janert%20P.%20K.%20-%20Gnuplot%20in%20Action,%20Second%20Edition%20-%202016.pdf][Janert P. K. - Gnuplot in Action, Second Edition - 2016]]
С18-С20

Gnuplot in Action
SECOND EDITION
PHILIPP K. JANERT


\[ z = \frac {\sum_i w(d_i) \cdot z_i} {\sum_i w(d_i) } \]

\[ d_i = \sqrt { \left( \frac{x-x_i}{dx} \right)^2 + \left(\frac{y-y_i}{dy} \right)^2 } \]



 gauss    w(d) = exp(-d^2)                                   
                         
 cauchy   w(d) = 1/(1+d^2)                                                            

 exp      w(d) = exp(-d)                                                              

 box      w(d) = 1 if d < 1; w(d) = 0 otherwise                                       

 hann     w(d) = (1-cos(2πd)) if |d| < 1; w(d) = 0 otherwise 
* Установка gsll
** 64

#+BEGIN_SRC bash
  pacman -S mingw64/mingw-w64-x86_64-gsl
  cd /mingw64/bin
  ln -s libgsl-23.dll libgsl-0.dll
#+END_SRC

** 32
#+BEGIN_SRC bash
  pacman -S mingw32/mingw-w64-i686-gsl
  cd /mingw32/bin
  ln -s libgsl-23.dll libgsl-0.dll
#+END_SRC

#+RESULTS:



#+BEGIN_SRC lisp
  (defparameter *a*
   (let ((rez 1))
     (dotimes (i 30000 rez)
       (setf rez (* rez (random 1000000000000000000000000))))))

  (defparameter *b*
   (let ((rez 1))
     (dotimes (i 30000 rez)
       (setf rez (* rez (random 1000000000000000000000000))))))

  (let ((rez (* *a* *b*)))
    'done)


#+END_SRC
* Gnuplot

** Примеры правильного формата пути для OS Windows

splot 'D:\\PRG\\msys32\\home\\namatv\\splot.data' u 1:2:3
splot "D:\\PRG\\msys32\\home\\namatv\\splot.data" u 1:2:3
splot "D:/PRG/msys32/home/namatv/splot.data" u 1:2:3
splot 'D:/PRG/msys32/home/namatv/splot.data' u 1:2:3

* git 
** Перечень удаленных репозиториев
 #+BEGIN_SRC bash 
 git remote
 #+END_SRC

 #+RESULTS:
 | github.com |
 | pi         |

** Коммит
 #+BEGIN_SRC bash :results none
 DATE=`date`
 git commit -a -m "$DATE"
 #+END_SRC

** Публикация изменений на удаленных серверах

 #+BEGIN_SRC bash :results none
 for i in github.com 
 do
 git push ${i} master
 done
 #+END_SRC

** Получение изменений с удаленных серверов
 #+BEGIN_SRC bash :results none
 for i in github.com 
 do
 git pull ${i} master
 done
 #+END_SRC

